podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/TRNG0_0x400A0000_MK28F15.svd.xml
<!--
Devices using this peripheral:
      MK28F15
-->
      <peripheral>
         <?sourceFile "TRNG0_0x400A0000_MK28F15" ?>
         <name>TRNG0</name>
         <description>True Random Number Generator</description>
         <groupName>TRNG</groupName>
         <headerStructName>TRNG</headerStructName>
         <baseAddress>0x400A0000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0xB0</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xF0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MCTL</name>
               <description>Miscellaneous Control Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x12001</resetValue>
               <fields>
                  <field>
                     <name>SAMP_MODE</name>
                     <description>Sample Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Von Neumann data into both Entropy shifter and Statistical Checker</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Raw data into both Entropy shifter and Statistical Checker</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Von Neumann data into Entropy shifter. Use raw data into Statistical Checker</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>undefined/reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSC_DIV</name>
                     <description>Ring Oscillator Divider</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Direct</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Divide by 2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Divide by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Divide by 8</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRNG_ACC</name>
                     <description>Access Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Generate Entropy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RST_DEF</name>
                     <description>Reset Defaults</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Action</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Software Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FOR_SCLK</name>
                     <description>Force System Clock</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Ring Oscillator</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>System Clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCT_FAIL</name>
                     <description>Frequency Count Fail</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No failure</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Failed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCT_VAL</name>
                     <description>Frequency Count Valid. Indicates that a valid frequency count may be read from FRQCNT</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Invalid</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Valid</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENT_VAL</name>
                     <description>Entropy Valid</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Invalid</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Valid</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TST_OUT</name>
                     <description>Test point inside ring oscillator</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TP Low</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TP High</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>Error status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Error detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSTOP_OK</name>
                     <description>TRNG_OK_TO_STOP</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Busy</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>OK to stop</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRGM</name>
                     <description>Programming Mode Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Run mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Program mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCMISC</name>
               <description>Statistical Check Miscellaneous Register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x1001F</resetValue>
               <fields>
                  <field>
                     <name>LRUN_MAX</name>
                     <description>LONG RUN MAX LIMIT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RTY_CT</name>
                     <description>RETRY COUNT</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRRNG</name>
               <description>Poker Range Register</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x9A3</resetValue>
               <fields>
                  <field>
                     <name>PKR_RNG</name>
                     <description>Poker Range</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRMAX</name>
               <description>Poker Maximum Limit Register</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0x6920</resetValue>
               <fields>
                  <field>
                     <name>PKR_MAX</name>
                     <description>Poker Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRSQ</name>
               <description>Poker Square Calculation Result Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_SQ</name>
                     <description>Poker Square Calculation Result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDCTL</name>
               <description>Seed Control Register</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0xC8009C4</resetValue>
               <fields>
                  <field>
                     <name>SAMP_SIZE</name>
                     <description>Sample Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENT_DLY</name>
                     <description>Entropy Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SBLIM</name>
               <description>Sparse Bit Limit Register</description>
               <addressOffset>0x14</addressOffset>
               <resetValue>0x3F</resetValue>
               <fields>
                  <field>
                     <name>SB_LIM</name>
                     <description>Sparse Bit Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOTSAM</name>
               <description>Total Samples Register</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TOT_SAM</name>
                     <description>Total Samples</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRQMIN</name>
               <description>Frequency Count Minimum Limit Register</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0x640</resetValue>
               <fields>
                  <field>
                     <name>FRQ_MIN</name>
                     <description>Frequency Count Minimum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRQCNT</name>
               <description>Frequency Count Register</description>
               <addressOffset>0x1C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FRQ_CT</name>
                     <description>Frequency Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRQMAX</name>
               <description>Frequency Count Maximum Limit Register</description>
               <addressOffset>0x1C</addressOffset>
               <resetValue>0x6400</resetValue>
               <fields>
                  <field>
                     <name>FRQ_MAX</name>
                     <description>Frequency Counter Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCMC</name>
               <description>Statistical Check Monobit Count Register</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MONO_CT</name>
                     <description>Monobit Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCML</name>
               <description>Statistical Check Monobit Limit Register</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x10C0568</resetValue>
               <fields>
                  <field>
                     <name>MONO_MAX</name>
                     <description>Monobit Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MONO_RNG</name>
                     <description>Monobit Range</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR1C</name>
               <description>Statistical Check Run Length 1 Count Register</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>R1_0_CT</name>
                     <description>Runs of Zero, Length 1 Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>R1_1_CT</name>
                     <description>Runs of One, Length 1 Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR1L</name>
               <description>Statistical Check Run Length 1 Limit Register</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0xB20195</resetValue>
               <fields>
                  <field>
                     <name>RUN1_MAX</name>
                     <description>Run Length 1 Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>RUN1_RNG</name>
                     <description>Run Length 1 Range</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR2C</name>
               <description>Statistical Check Run Length 2 Count Register</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>R2_0_CT</name>
                     <description>Runs of Zero, Length 2 Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>R2_1_CT</name>
                     <description>Runs of One, Length 2 Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR2L</name>
               <description>Statistical Check Run Length 2 Limit Register</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x7A00DC</resetValue>
               <fields>
                  <field>
                     <name>RUN2_MAX</name>
                     <description>Run Length 2 Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>RUN2_RNG</name>
                     <description>Run Length 2 Range</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR3C</name>
               <description>Statistical Check Run Length 3 Count Register</description>
               <addressOffset>0x2C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>R3_0_CT</name>
                     <description>Runs of Zeroes, Length 3 Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>R3_1_CT</name>
                     <description>Runs of Ones, Length 3 Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
