podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/TRNG0_0x400A0000_MK28F15.svd.xml
            <register>
               <name>SCR3L</name>
               <description>Statistical Check Run Length 3 Limit Register</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x58007D</resetValue>
               <fields>
                  <field>
                     <name>RUN3_MAX</name>
                     <description>Run Length 3 Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>RUN3_RNG</name>
                     <description>Run Length 3 Range</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR4C</name>
               <description>Statistical Check Run Length 4 Count Register</description>
               <addressOffset>0x30</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>R4_0_CT</name>
                     <description>Runs of Zero, Length 4 Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>R4_1_CT</name>
                     <description>Runs of One, Length 4 Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR4L</name>
               <description>Statistical Check Run Length 4 Limit Register</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x40004B</resetValue>
               <fields>
                  <field>
                     <name>RUN4_MAX</name>
                     <description>Run Length 4 Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>RUN4_RNG</name>
                     <description>Run Length 4 Range</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR5C</name>
               <description>Statistical Check Run Length 5 Count Register</description>
               <addressOffset>0x34</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>R5_0_CT</name>
                     <description>Runs of Zero, Length 5 Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>R5_1_CT</name>
                     <description>Runs of One, Length 5 Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR5L</name>
               <description>Statistical Check Run Length 5 Limit Register</description>
               <addressOffset>0x34</addressOffset>
               <resetValue>0x2E002F</resetValue>
               <fields>
                  <field>
                     <name>RUN5_MAX</name>
                     <description>Run Length 5 Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>RUN5_RNG</name>
                     <description>Run Length 5 Range</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR6PC</name>
               <description>Statistical Check Run Length 6+ Count Register</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>R6P_0_CT</name>
                     <description>Runs of Zero, Length 6+ Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>R6P_1_CT</name>
                     <description>Runs of One, Length 6+ Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR6PL</name>
               <description>Statistical Check Run Length 6+ Limit Register</description>
               <addressOffset>0x38</addressOffset>
               <resetValue>0x2E002F</resetValue>
               <fields>
                  <field>
                     <name>RUN6P_MAX</name>
                     <description>Run Length 6+ Maximum Limit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>RUN6P_RNG</name>
                     <description>Run Length 6+ Range</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status Register</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TF1BR0</name>
                     <description>Test Fail, 1-Bit Run, Sampling 0s. If TF1BR0=1, the 1-Bit Run, Sampling 0s Test has failed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF1BR1</name>
                     <description>Test Fail, 1-Bit Run, Sampling 1s. If TF1BR1=1, the 1-Bit Run, Sampling 1s Test has failed</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF2BR0</name>
                     <description>Test Fail, 2-Bit Run, Sampling 0s. If TF2BR0=1, the 2-Bit Run, Sampling 0s Test has failed</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF2BR1</name>
                     <description>Test Fail, 2-Bit Run, Sampling 1s. If TF2BR1=1, the 2-Bit Run, Sampling 1s Test has failed</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF3BR0</name>
                     <description>Test Fail, 3-Bit Run, Sampling 0s. If TF3BR0=1, the 3-Bit Run, Sampling 0s Test has failed</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF3BR1</name>
                     <description>Test Fail, 3-Bit Run, Sampling 1s. If TF3BR1=1, the 3-Bit Run, Sampling 1s Test has failed</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF4BR0</name>
                     <description>Test Fail, 4-Bit Run, Sampling 0s. If TF4BR0=1, the 4-Bit Run, Sampling 0s Test has failed</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF4BR1</name>
                     <description>Test Fail, 4-Bit Run, Sampling 1s. If TF4BR1=1, the 4-Bit Run, Sampling 1s Test has failed</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF5BR0</name>
                     <description>Test Fail, 5-Bit Run, Sampling 0s. If TF5BR0=1, the 5-Bit Run, Sampling 0s Test has failed</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF5BR1</name>
                     <description>Test Fail, 5-Bit Run, Sampling 1s. If TF5BR1=1, the 5-Bit Run, Sampling 1s Test has failed</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF6PBR0</name>
                     <description>Test Fail, 6 Plus Bit Run, Sampling 0s</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TF6PBR1</name>
                     <description>Test Fail, 6 Plus Bit Run, Sampling 1s</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFSB</name>
                     <description>Test Fail, Sparse Bit. If TFSB=1, the Sparse Bit Test has failed</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFLR</name>
                     <description>Test Fail, Long Run. If TFLR=1, the Long Run Test has failed</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFP</name>
                     <description>Test Fail, Poker. If TFP=1, the Poker Test has failed</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFMB</name>
                     <description>Test Fail, Mono Bit. If TFMB=1, the Mono Bit Test has failed</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RETRY_CT</name>
                     <description>RETRY COUNT</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>ENT%s</name>
               <description>Entropy Read Register</description>
               <addressOffset>0x40</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>ENT</name>
                     <description>Entropy Value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNT10</name>
               <description>Statistical Check Poker Count 1 and 0 Register</description>
               <addressOffset>0x80</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_0_CT</name>
                     <description>Poker 0h Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_1_CT</name>
                     <description>Poker 1h Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNT32</name>
               <description>Statistical Check Poker Count 3 and 2 Register</description>
               <addressOffset>0x84</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_2_CT</name>
                     <description>Poker 2h Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_3_CT</name>
                     <description>Poker 3h Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNT54</name>
               <description>Statistical Check Poker Count 5 and 4 Register</description>
               <addressOffset>0x88</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_4_CT</name>
                     <description>Poker 4h Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_5_CT</name>
                     <description>Poker 5h Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNT76</name>
               <description>Statistical Check Poker Count 7 and 6 Register</description>
               <addressOffset>0x8C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_6_CT</name>
                     <description>Poker 6h Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_7_CT</name>
                     <description>Poker 7h Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNT98</name>
               <description>Statistical Check Poker Count 9 and 8 Register</description>
               <addressOffset>0x90</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_8_CT</name>
                     <description>Poker 8h Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_9_CT</name>
                     <description>Poker 9h Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNTBA</name>
               <description>Statistical Check Poker Count B and A Register</description>
               <addressOffset>0x94</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_A_CT</name>
                     <description>Poker Ah Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_B_CT</name>
                     <description>Poker Bh Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNTDC</name>
               <description>Statistical Check Poker Count D and C Register</description>
               <addressOffset>0x98</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_C_CT</name>
                     <description>Poker Ch Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_D_CT</name>
                     <description>Poker Dh Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKRCNTFE</name>
               <description>Statistical Check Poker Count F and E Register</description>
               <addressOffset>0x9C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PKR_E_CT</name>
                     <description>Poker Eh Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PKR_F_CT</name>
                     <description>Poker Fh Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEC_CFG</name>
               <description>Security Configuration Register</description>
               <addressOffset>0xA0</addressOffset>
               <fields>
                  <field>
                     <name>NO_PRGM</name>
                     <description>TRNG register protection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Registers are protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT_CTRL</name>
               <description>Interrupt Control Register</description>
               <addressOffset>0xA4</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>HW_ERR</name>
                     <description>Clear Hardware Error flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Flag Cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No Effect</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENT_VAL</name>
                     <description>Clear Entropy Available flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Flag Cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No Effect</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRQ_CT_FAIL</name>
                     <description>Clear Frequency Count Error flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Flag Cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No Effect</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
